print("1+1=", 1 + 1)
print("6-5=", 6 - 5)
print("9*9=", 9 * 9)
print("9/2=", 9 / 2)  # 输出结果为 4.5
# 以上是常用运算符。依次是 加 减 乘 除
print("9//2=", 9 // 2)  # 取整数，结果为 4
print("9%2=", 9 % 2)  # 取余数，结果为 1
print("2**3=", 2 ** 3)  # 求平方，结果为 8 （2*2*2）就是三个2相乘

# ——————以下是赋值运算符——————
print("——————以下是赋值运算符——————")
num = 1  # 初始值 1
num += 5  # 初始值 + 5
print(num)  # 结果为 6

num -= 1  # 减 1
print(num)  # 结果为 5

num *= 9  # 乘 3
print("5*9=", num)  # 结果为 45

num /= 2
print(num)  # 结果为 22.5

num //= 2  # 22.5/2 的整数
print(num)  # 结果为 11.0

num %= 4
print(num)  # 11 ÷ 4 余 3

num **= 4
print(num)  # （3*3*3*3）结果为 81.0
