worker = {
    "王力宏": {
        "部门": "科技部",
        "工资": 3400,
        "级别": 1

    },
    "周杰伦": {
        "部门": "宣传部",
        "工资": 4000,
        "级别": 2
    },
    "陈奕迅": {
        "部门": "市场部",
        "工资": 3000,
        "级别": 1
    },
    "陈伟霆": {
        "部门": "科技部",
        "工资": 5500,
        "级别": 3
    },
    "王歌": {
        "部门": "科技部",
        "工资": 5500,
        "级别": 1
    }
}
print(worker)
for name in worker:
    if worker[name]["级别"] == 1:
        worker[name]["级别"] += 1
        worker[name]["工资"] += 1000
print(worker)
